tests/load-test.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Sustained load"
    - duration: 60
      arrivalRate: 100
      name: "Peak load"
  processor: "./test-helpers.js"

scenarios:
  - name: "Browse businesses"
    weight: 40
    flow:
      - get:
          url: "/api/businesses?category=mechanics&page=1&limit=20"
          expect:
            - statusCode: 200
            - contentType: json
      - think: 2

  - name: "View business profile"
    weight: 30
    flow:
      - get:
          url: "/api/businesses"
          capture:
            - json: "$.data[0].slug"
              as: "slug"
      - get:
          url: "/api/businesses/{{ slug }}"
          expect:
            - statusCode: 200
      - think: 5

  - name: "Search businesses"
    weight: 20
    flow:
      - get:
          url: "/api/search?q=auto+repair+toronto"
          expect:
            - statusCode: 200
            - contentType: json
      - think: 3

  - name: "Get top businesses"
    weight: 10
    flow:
      - get:
          url: "/api/businesses/top/mechanics?limit=10"
          expect:
            - statusCode: 200
            - contentType: json
      - think: 2